/**
 * Created by smit9 on 25.05.16.
 */

//определим положение курсора в момент ввода символа
var inputText = $(this),
    cursorPozition = inputText[0].selectionStart;

//массив сооветсвия. Заменям кирилицу на латиницу согласно клавиатуры
var map = {
    'й' : 'q', 'ц' : 'w', 'у' : 'e', 'к' : 'r', 'е' : 't', 'н' : 'y', 'г' : 'u', 'ш' : 'i', 'щ' : 'o', 'з' : 'p', 'х' : '[', 'ъ' : ']',
    'ф' : 'a', 'ы' : 's', 'в' : 'd', 'а' : 'f', 'п' : 'g', 'р' : 'h', 'о' : 'j', 'л' : 'k', 'д' : 'l', 'ж' : ';', 'э' : '\'',
    'я' : 'z', 'ч' : 'x', 'с' : 'c', 'м' : 'v', 'и' : 'b', 'т' : 'n', 'ь' : 'm', 'б' : ',', 'ю' : '.', 'ё' : '\\',
    'Й' : 'Q', 'Ц' : 'W', 'У' : 'E', 'К' : 'R', 'Е' : 'T', 'Н' : 'Y', 'Г' : 'U', 'Ш' : 'I', 'Щ' : 'O', 'З' : 'P', 'Х' : '[', 'Ъ' : ']',
    'Ф' : 'A', 'Ы' : 'S', 'В' : 'D', 'А' : 'F', 'П' : 'G', 'Р' : 'H', 'О' : 'J', 'Л' : 'K', 'Д' : 'L', 'Ж' : ';', 'Э' : '\'',
    'Я' : 'Z', 'Ч' : 'X', 'С' : 'C', 'М' : 'V', 'И' : 'B', 'Т' : 'N', 'Ь' : 'M', 'Б' : ',', 'Ю' : '.', 'Ё' : '|',
    '"' : '@'
};
//забираем строку из инпута
var str = $(this).val();
var r = '';
//производим замену кирилицы на латиницу
for (var i = 0; i < str.length; i++) {
    r += map[str.charAt(i)] || str.charAt(i);
}
//устанавливаем значение в инпут
inputText.val(r);

//устанавливаем курсор в нужную позицию
if( cursorPozition != undefined)
    inputText[0].setSelectionRange(cursorPozition, cursorPozition);